alphablog/app/views/alpha_blogs/_alpha_blog.html.erb

        <div style="position : relative; top : 2pc;">
          <% if alpha_blog.categories.any? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "alpha_blog_categories" ON "categories"."id" = "alpha_blog_categories"."category_id" WHERE "alpha_blog_categories"."alpha_blog_id" = ?  [["alpha_blog_id", 5]]
SELECT 1 AS one FROM "categories" INNER JOIN "alpha_blog_categories" ON "categories"."id" = "alpha_blog_categories"."category_id" WHERE "alpha_blog_categories"."alpha_blog_id" = ? LIMIT ?  [["alpha_blog_id", 5], ["LIMIT", 1]]