alphablog/app/views/alpha_blogs/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category, style: "display: block" %>
    <%= form.collection_select(:category_ids, Category.all, :id, :category,
            { prompt: "Make your selection from the list below (can be empty)"}, { multiple: true, size: 3, style: "display: block"}) %>

SELECT "categories".* FROM "categories"
---
    <%= form.label :subcategory, style: "display: block" %>
    <%= form.collection_select(:category_ids, Category.all, :id, :subcategory,
            { prompt: "Make your selection from the list below (can be empty)"}, { multiple: true, size: 3, style: "display: block"}) %>