alphablog/app/views/users/index.html.erb

SELECT COUNT(*) FROM "alpha_blogs" WHERE "alpha_blogs"."user_id" = ?  [["user_id", 3]]
---
      </h5>
      <p class="card-text"><%= pluralize(user.alpha_blog.count, " My activity !") %></p>