alphablog/app/views/users/show.html.erb

            </h5>
            <p class="card-text"> <%pluralize(blogs.alpha_blogs.count, " My activity !", "alpha_blog") %></p>
---
SELECT COUNT(*) FROM "alpha_blogs" WHERE "alpha_blogs"."user_id" = ?  [["user_id", 5]]