alphablog/app/controllers/alpha_blogs_controller.rb

  def index
    @alpha_blogs = AlphaBlog.paginate(page: params[:page], page: 1)
---
SELECT "alpha_blogs".* FROM "alpha_blogs" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 30]]

  def create
    @alpha_blog = AlphaBlog.new(alpha_blog_params)
    @alpha_blog.user = current_user
    respond_to do |format|
      if @alpha_blog.save
---
INSERT INTO "alpha_blogs" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @alpha_blog.update(alpha_blog_params)
---
UPDATE "alpha_blogs" SET "title" = ?, "updated_at" = ? WHERE "alpha_blogs"."id" = ?  [["title", "Ferrari car"], ["updated_at", "2024-03-18 15:23:57.304474"], ["id", 2]]

  def destroy
    @alpha_blog.destroy!
---
DELETE FROM "alpha_blogs" WHERE "alpha_blogs"."id" = ?  [["id", 2]]

    def set_alpha_blog
      @alpha_blog = AlphaBlog.find(params[:id])
---
SELECT "alpha_blogs".* FROM "alpha_blogs" WHERE "alpha_blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]