alphablog/app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page: 1)
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "subcategory", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["category", "Cars"], ["subcategory", "Luxury"], ["created_at", "2024-03-21 05:11:24.485685"], ["updated_at", "2024-03-21 05:11:24.485685"]]

  def destroy
    @category.destroy!
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]