alphablog/app/controllers/users_controller.rb

  def show
    @users = User.paginate(page: params[:page], per_page: 1)
---
SELECT COUNT(*) FROM "users"