alphablog/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 30]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], page: 1)

SELECT "alpha_blogs".* FROM "alpha_blogs" WHERE "alpha_blogs"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 5], ["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "alpha_blogs" WHERE "alpha_blogs"."user_id" = ?  [["user_id", 5]]
---
  def show
    @alpha_blog = @user.alpha_blog.paginate(page: params[:page], page: 1)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "daredevil"], ["email", "daredevil@gmail.com"], ["created_at", "2024-03-19 12:36:09.839970"], ["updated_at", "2024-03-19 12:36:09.839970"], ["password_digest", "[FILTERED]"]]
---
  def create

       @user = User.new(user_params)

       respond_to do |format|
       if @user.save